arendst/Tasmota/arduino/version 2.5.0/boards.txt
##############################################################
cw01.name=XinaBox CW01
cw01.build.board=ESP8266_GENERIC
cw01.build.variant=xinabox
cw01.upload.tool=esptool
cw01.upload.maximum_data_size=81920
cw01.upload.wait_for_upload_port=true
cw01.upload.erase_cmd=
cw01.serial.disableDTR=true
cw01.serial.disableRTS=true
cw01.build.mcu=esp8266
cw01.build.core=esp8266
cw01.build.spiffs_pagesize=256
cw01.build.debug_port=
cw01.build.debug_level=
cw01.menu.xtal.80=80 MHz
cw01.menu.xtal.80.build.f_cpu=80000000L
cw01.menu.xtal.160=160 MHz
cw01.menu.xtal.160.build.f_cpu=160000000L
cw01.menu.vt.flash=Flash
cw01.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
cw01.menu.vt.heap=Heap
cw01.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
cw01.menu.vt.iram=IRAM
cw01.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
cw01.menu.exception.disabled=Disabled
cw01.menu.exception.disabled.build.exception_flags=-fno-exceptions
cw01.menu.exception.disabled.build.stdcpp_lib=-lstdc++
cw01.menu.exception.enabled=Enabled
cw01.menu.exception.enabled.build.exception_flags=-fexceptions
cw01.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
cw01.upload.resetmethod=nodemcu
cw01.menu.CrystalFreq.26=26 MHz
cw01.menu.CrystalFreq.40=40 MHz
cw01.menu.CrystalFreq.40.build.extra_flags=-DF_CRYSTAL=40000000 -DESP8266
cw01.build.flash_mode=dio
cw01.build.flash_flags=-DFLASHMODE_DIO
cw01.build.flash_freq=40
cw01.menu.eesz.4M=4M (no SPIFFS)
cw01.menu.eesz.4M.build.flash_size=4M
cw01.menu.eesz.4M.build.flash_size_bytes=0x400000
cw01.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
cw01.menu.eesz.4M.build.spiffs_pagesize=256
cw01.menu.eesz.4M.upload.maximum_size=1044464
cw01.menu.eesz.4M.build.rfcal_addr=0x3FC000
cw01.menu.eesz.4M1M=4M (1M SPIFFS)
cw01.menu.eesz.4M1M.build.flash_size=4M
cw01.menu.eesz.4M1M.build.flash_size_bytes=0x400000
cw01.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
cw01.menu.eesz.4M1M.build.spiffs_pagesize=256
cw01.menu.eesz.4M1M.upload.maximum_size=1044464
cw01.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
cw01.menu.eesz.4M1M.build.spiffs_start=0x300000
cw01.menu.eesz.4M1M.build.spiffs_end=0x3FB000
cw01.menu.eesz.4M1M.build.spiffs_blocksize=8192
cw01.menu.eesz.4M2M=4M (2M SPIFFS)
cw01.menu.eesz.4M2M.build.flash_size=4M
cw01.menu.eesz.4M2M.build.flash_size_bytes=0x400000
cw01.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
cw01.menu.eesz.4M2M.build.spiffs_pagesize=256
cw01.menu.eesz.4M2M.upload.maximum_size=1044464
cw01.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
cw01.menu.eesz.4M2M.build.spiffs_start=0x200000
cw01.menu.eesz.4M2M.build.spiffs_end=0x3FB000
cw01.menu.eesz.4M2M.build.spiffs_blocksize=8192
cw01.menu.eesz.4M3M=4M (3M SPIFFS)
cw01.menu.eesz.4M3M.build.flash_size=4M
cw01.menu.eesz.4M3M.build.flash_size_bytes=0x400000
cw01.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
cw01.menu.eesz.4M3M.build.spiffs_pagesize=256
cw01.menu.eesz.4M3M.upload.maximum_size=1044464
cw01.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
cw01.menu.eesz.4M3M.build.spiffs_start=0x100000
cw01.menu.eesz.4M3M.build.spiffs_end=0x3FB000
cw01.menu.eesz.4M3M.build.spiffs_blocksize=8192
cw01.menu.ip.lm2f=v2 Lower Memory
cw01.menu.ip.lm2f.build.lwip_include=lwip2/include
cw01.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
cw01.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
cw01.menu.ip.hb2f=v2 Higher Bandwidth
cw01.menu.ip.hb2f.build.lwip_include=lwip2/include
cw01.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
cw01.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
cw01.menu.ip.lm2n=v2 Lower Memory (no features)
cw01.menu.ip.lm2n.build.lwip_include=lwip2/include
cw01.menu.ip.lm2n.build.lwip_lib=-llwip2-536
cw01.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
cw01.menu.ip.hb2n=v2 Higher Bandwidth (no features)
cw01.menu.ip.hb2n.build.lwip_include=lwip2/include
cw01.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
cw01.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
cw01.menu.ip.lm6f=v2 IPv6 Lower Memory
cw01.menu.ip.lm6f.build.lwip_include=lwip2/include
cw01.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
cw01.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
cw01.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
cw01.menu.ip.hb6f.build.lwip_include=lwip2/include
cw01.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
cw01.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
cw01.menu.ip.hb1=v1.4 Higher Bandwidth
cw01.menu.ip.hb1.build.lwip_lib=-llwip_gcc
cw01.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
cw01.menu.ip.src=v1.4 Compile from source
cw01.menu.ip.src.build.lwip_lib=-llwip_src
cw01.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
cw01.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
cw01.menu.dbg.Disabled=Disabled
cw01.menu.dbg.Disabled.build.debug_port=
cw01.menu.dbg.Serial=Serial
cw01.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
cw01.menu.dbg.Serial1=Serial1
cw01.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
cw01.menu.lvl.None____=None
cw01.menu.lvl.None____.build.debug_level=
cw01.menu.lvl.SSL=SSL
cw01.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
cw01.menu.lvl.TLS_MEM=TLS_MEM
cw01.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
cw01.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
cw01.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
cw01.menu.lvl.HTTP_SERVER=HTTP_SERVER
cw01.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
cw01.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
cw01.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
cw01.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
cw01.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
cw01.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
cw01.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
cw01.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
cw01.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
cw01.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
cw01.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
cw01.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
cw01.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
cw01.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
cw01.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
cw01.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
cw01.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
cw01.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
cw01.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
cw01.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
cw01.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
cw01.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
cw01.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
cw01.menu.lvl.CORE=CORE
cw01.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
cw01.menu.lvl.WIFI=WIFI
cw01.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
cw01.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
cw01.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
cw01.menu.lvl.UPDATER=UPDATER
cw01.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
cw01.menu.lvl.OTA=OTA
cw01.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
cw01.menu.lvl.OOM=OOM
cw01.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
cw01.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
cw01.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
cw01.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
cw01.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
cw01.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
cw01.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
cw01.menu.wipe.none=Only Sketch
cw01.menu.wipe.none.upload.erase_cmd=
cw01.menu.wipe.sdk=Sketch + WiFi Settings
cw01.menu.wipe.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
cw01.menu.wipe.all=All Flash Contents
cw01.menu.wipe.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
cw01.menu.baud.115200=115200
cw01.menu.baud.115200.upload.speed=115200
cw01.menu.baud.9600=9600
cw01.menu.baud.9600.upload.speed=9600
cw01.menu.baud.57600=57600
cw01.menu.baud.57600.upload.speed=57600
cw01.menu.baud.230400.linux=230400
cw01.menu.baud.230400.macosx=230400
cw01.menu.baud.230400.upload.speed=230400
cw01.menu.baud.256000.windows=256000
cw01.menu.baud.256000.upload.speed=256000
cw01.menu.baud.460800.linux=460800
cw01.menu.baud.460800.macosx=460800
cw01.menu.baud.460800.upload.speed=460800
cw01.menu.baud.512000.windows=512000
cw01.menu.baud.512000.upload.speed=512000
cw01.menu.baud.921600=921600
cw01.menu.baud.921600.upload.speed=921600

