arendst/Tasmota/arduino/version 2.5.0/boards.txt
##############################################################
oak.name=Digistump Oak
oak.build.board=ESP8266_OAK
oak.build.variant=oak
oak.upload.maximum_size=1040368
oak.upload.tool=esptool
oak.upload.maximum_data_size=81920
oak.upload.wait_for_upload_port=true
oak.upload.erase_cmd=
oak.serial.disableDTR=true
oak.serial.disableRTS=true
oak.build.mcu=esp8266
oak.build.core=esp8266
oak.build.spiffs_pagesize=256
oak.build.debug_port=
oak.build.debug_level=
oak.menu.xtal.80=80 MHz
oak.menu.xtal.80.build.f_cpu=80000000L
oak.menu.xtal.160=160 MHz
oak.menu.xtal.160.build.f_cpu=160000000L
oak.menu.vt.flash=Flash
oak.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
oak.menu.vt.heap=Heap
oak.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
oak.menu.vt.iram=IRAM
oak.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
oak.menu.exception.disabled=Disabled
oak.menu.exception.disabled.build.exception_flags=-fno-exceptions
oak.menu.exception.disabled.build.stdcpp_lib=-lstdc++
oak.menu.exception.enabled=Enabled
oak.menu.exception.enabled.build.exception_flags=-fexceptions
oak.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
oak.upload.resetmethod=none
oak.build.flash_mode=dio
oak.build.flash_flags=-DFLASHMODE_DIO
oak.build.flash_freq=40
oak.menu.eesz.4M=4M (no SPIFFS)
oak.menu.eesz.4M.build.flash_size=4M
oak.menu.eesz.4M.build.flash_size_bytes=0x400000
oak.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
oak.menu.eesz.4M.build.spiffs_pagesize=256
oak.menu.eesz.4M.upload.maximum_size=1044464
oak.menu.eesz.4M.build.rfcal_addr=0x3FC000
oak.menu.eesz.4M1M=4M (1M SPIFFS)
oak.menu.eesz.4M1M.build.flash_size=4M
oak.menu.eesz.4M1M.build.flash_size_bytes=0x400000
oak.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
oak.menu.eesz.4M1M.build.spiffs_pagesize=256
oak.menu.eesz.4M1M.upload.maximum_size=1044464
oak.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
oak.menu.eesz.4M1M.build.spiffs_start=0x300000
oak.menu.eesz.4M1M.build.spiffs_end=0x3FB000
oak.menu.eesz.4M1M.build.spiffs_blocksize=8192
oak.menu.eesz.4M2M=4M (2M SPIFFS)
oak.menu.eesz.4M2M.build.flash_size=4M
oak.menu.eesz.4M2M.build.flash_size_bytes=0x400000
oak.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
oak.menu.eesz.4M2M.build.spiffs_pagesize=256
oak.menu.eesz.4M2M.upload.maximum_size=1044464
oak.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
oak.menu.eesz.4M2M.build.spiffs_start=0x200000
oak.menu.eesz.4M2M.build.spiffs_end=0x3FB000
oak.menu.eesz.4M2M.build.spiffs_blocksize=8192
oak.menu.eesz.4M3M=4M (3M SPIFFS)
oak.menu.eesz.4M3M.build.flash_size=4M
oak.menu.eesz.4M3M.build.flash_size_bytes=0x400000
oak.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
oak.menu.eesz.4M3M.build.spiffs_pagesize=256
oak.menu.eesz.4M3M.upload.maximum_size=1044464
oak.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
oak.menu.eesz.4M3M.build.spiffs_start=0x100000
oak.menu.eesz.4M3M.build.spiffs_end=0x3FB000
oak.menu.eesz.4M3M.build.spiffs_blocksize=8192
oak.menu.ip.lm2f=v2 Lower Memory
oak.menu.ip.lm2f.build.lwip_include=lwip2/include
oak.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
oak.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
oak.menu.ip.hb2f=v2 Higher Bandwidth
oak.menu.ip.hb2f.build.lwip_include=lwip2/include
oak.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
oak.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
oak.menu.ip.lm2n=v2 Lower Memory (no features)
oak.menu.ip.lm2n.build.lwip_include=lwip2/include
oak.menu.ip.lm2n.build.lwip_lib=-llwip2-536
oak.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
oak.menu.ip.hb2n=v2 Higher Bandwidth (no features)
oak.menu.ip.hb2n.build.lwip_include=lwip2/include
oak.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
oak.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
oak.menu.ip.lm6f=v2 IPv6 Lower Memory
oak.menu.ip.lm6f.build.lwip_include=lwip2/include
oak.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
oak.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
oak.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
oak.menu.ip.hb6f.build.lwip_include=lwip2/include
oak.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
oak.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
oak.menu.ip.hb1=v1.4 Higher Bandwidth
oak.menu.ip.hb1.build.lwip_lib=-llwip_gcc
oak.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
oak.menu.ip.src=v1.4 Compile from source
oak.menu.ip.src.build.lwip_lib=-llwip_src
oak.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
oak.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
oak.menu.dbg.Disabled=Disabled
oak.menu.dbg.Disabled.build.debug_port=
oak.menu.dbg.Serial=Serial
oak.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
oak.menu.dbg.Serial1=Serial1
oak.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
oak.menu.lvl.None____=None
oak.menu.lvl.None____.build.debug_level=
oak.menu.lvl.SSL=SSL
oak.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
oak.menu.lvl.TLS_MEM=TLS_MEM
oak.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
oak.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
oak.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
oak.menu.lvl.HTTP_SERVER=HTTP_SERVER
oak.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
oak.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
oak.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
oak.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
oak.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
oak.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
oak.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
oak.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
oak.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
oak.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
oak.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
oak.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
oak.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
oak.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
oak.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
oak.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
oak.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
oak.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
oak.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
oak.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
oak.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
oak.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
oak.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
oak.menu.lvl.CORE=CORE
oak.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
oak.menu.lvl.WIFI=WIFI
oak.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
oak.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
oak.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
oak.menu.lvl.UPDATER=UPDATER
oak.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
oak.menu.lvl.OTA=OTA
oak.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
oak.menu.lvl.OOM=OOM
oak.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
oak.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
oak.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
oak.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
oak.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
oak.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
oak.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
oak.menu.wipe.none=Only Sketch
oak.menu.wipe.none.upload.erase_cmd=
oak.menu.wipe.sdk=Sketch + WiFi Settings
oak.menu.wipe.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
oak.menu.wipe.all=All Flash Contents
oak.menu.wipe.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
oak.menu.baud.921600=921600
oak.menu.baud.921600.upload.speed=921600
oak.menu.baud.9600=9600
oak.menu.baud.9600.upload.speed=9600
oak.menu.baud.57600=57600
oak.menu.baud.57600.upload.speed=57600
oak.menu.baud.115200=115200
oak.menu.baud.115200.upload.speed=115200
oak.menu.baud.230400.linux=230400
oak.menu.baud.230400.macosx=230400
oak.menu.baud.230400.upload.speed=230400
oak.menu.baud.256000.windows=256000
oak.menu.baud.256000.upload.speed=256000
oak.menu.baud.460800.linux=460800
oak.menu.baud.460800.macosx=460800
oak.menu.baud.460800.upload.speed=460800
oak.menu.baud.512000.windows=512000
oak.menu.baud.512000.upload.speed=512000

