arendst/Tasmota/arduino/version 2.5.0/boards.txt
##############################################################
wifi_slot.name=Amperka WiFi Slot
wifi_slot.build.board=AMPERKA_WIFI_SLOT
wifi_slot.build.variant=wifi_slot
wifi_slot.upload.tool=esptool
wifi_slot.upload.maximum_data_size=81920
wifi_slot.upload.wait_for_upload_port=true
wifi_slot.upload.erase_cmd=
wifi_slot.serial.disableDTR=true
wifi_slot.serial.disableRTS=true
wifi_slot.build.mcu=esp8266
wifi_slot.build.core=esp8266
wifi_slot.build.spiffs_pagesize=256
wifi_slot.build.debug_port=
wifi_slot.build.debug_level=
wifi_slot.menu.xtal.80=80 MHz
wifi_slot.menu.xtal.80.build.f_cpu=80000000L
wifi_slot.menu.xtal.160=160 MHz
wifi_slot.menu.xtal.160.build.f_cpu=160000000L
wifi_slot.menu.vt.flash=Flash
wifi_slot.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
wifi_slot.menu.vt.heap=Heap
wifi_slot.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
wifi_slot.menu.vt.iram=IRAM
wifi_slot.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
wifi_slot.menu.exception.disabled=Disabled
wifi_slot.menu.exception.disabled.build.exception_flags=-fno-exceptions
wifi_slot.menu.exception.disabled.build.stdcpp_lib=-lstdc++
wifi_slot.menu.exception.enabled=Enabled
wifi_slot.menu.exception.enabled.build.exception_flags=-fexceptions
wifi_slot.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
wifi_slot.upload.resetmethod=nodemcu
wifi_slot.menu.FlashFreq.40=40MHz
wifi_slot.menu.FlashFreq.40.build.flash_freq=40
wifi_slot.menu.FlashFreq.80=80MHz
wifi_slot.menu.FlashFreq.80.build.flash_freq=80
wifi_slot.menu.FlashMode.dout=DOUT (compatible)
wifi_slot.menu.FlashMode.dout.build.flash_mode=dout
wifi_slot.menu.FlashMode.dout.build.flash_flags=-DFLASHMODE_DOUT
wifi_slot.menu.FlashMode.dio=DIO
wifi_slot.menu.FlashMode.dio.build.flash_mode=dio
wifi_slot.menu.FlashMode.dio.build.flash_flags=-DFLASHMODE_DIO
wifi_slot.menu.FlashMode.qout=QOUT
wifi_slot.menu.FlashMode.qout.build.flash_mode=qout
wifi_slot.menu.FlashMode.qout.build.flash_flags=-DFLASHMODE_QOUT
wifi_slot.menu.FlashMode.qio=QIO (fast)
wifi_slot.menu.FlashMode.qio.build.flash_mode=qio
wifi_slot.menu.FlashMode.qio.build.flash_flags=-DFLASHMODE_QIO
wifi_slot.menu.eesz.1M=1M (no SPIFFS)
wifi_slot.menu.eesz.1M.build.flash_size=1M
wifi_slot.menu.eesz.1M.build.flash_size_bytes=0x100000
wifi_slot.menu.eesz.1M.build.flash_ld=eagle.flash.1m.ld
wifi_slot.menu.eesz.1M.build.spiffs_pagesize=256
wifi_slot.menu.eesz.1M.upload.maximum_size=1023984
wifi_slot.menu.eesz.1M.build.rfcal_addr=0xFC000
wifi_slot.menu.eesz.1M64=1M (64K SPIFFS)
wifi_slot.menu.eesz.1M64.build.flash_size=1M
wifi_slot.menu.eesz.1M64.build.flash_size_bytes=0x100000
wifi_slot.menu.eesz.1M64.build.flash_ld=eagle.flash.1m64.ld
wifi_slot.menu.eesz.1M64.build.spiffs_pagesize=256
wifi_slot.menu.eesz.1M64.upload.maximum_size=958448
wifi_slot.menu.eesz.1M64.build.rfcal_addr=0xFC000
wifi_slot.menu.eesz.1M64.build.spiffs_start=0xEB000
wifi_slot.menu.eesz.1M64.build.spiffs_end=0xFB000
wifi_slot.menu.eesz.1M64.build.spiffs_blocksize=4096
wifi_slot.menu.eesz.1M128=1M (128K SPIFFS)
wifi_slot.menu.eesz.1M128.build.flash_size=1M
wifi_slot.menu.eesz.1M128.build.flash_size_bytes=0x100000
wifi_slot.menu.eesz.1M128.build.flash_ld=eagle.flash.1m128.ld
wifi_slot.menu.eesz.1M128.build.spiffs_pagesize=256
wifi_slot.menu.eesz.1M128.upload.maximum_size=892912
wifi_slot.menu.eesz.1M128.build.rfcal_addr=0xFC000
wifi_slot.menu.eesz.1M128.build.spiffs_start=0xDB000
wifi_slot.menu.eesz.1M128.build.spiffs_end=0xFB000
wifi_slot.menu.eesz.1M128.build.spiffs_blocksize=4096
wifi_slot.menu.eesz.1M144=1M (144K SPIFFS)
wifi_slot.menu.eesz.1M144.build.flash_size=1M
wifi_slot.menu.eesz.1M144.build.flash_size_bytes=0x100000
wifi_slot.menu.eesz.1M144.build.flash_ld=eagle.flash.1m144.ld
wifi_slot.menu.eesz.1M144.build.spiffs_pagesize=256
wifi_slot.menu.eesz.1M144.upload.maximum_size=876528
wifi_slot.menu.eesz.1M144.build.rfcal_addr=0xFC000
wifi_slot.menu.eesz.1M144.build.spiffs_start=0xD7000
wifi_slot.menu.eesz.1M144.build.spiffs_end=0xFB000
wifi_slot.menu.eesz.1M144.build.spiffs_blocksize=4096
wifi_slot.menu.eesz.1M160=1M (160K SPIFFS)
wifi_slot.menu.eesz.1M160.build.flash_size=1M
wifi_slot.menu.eesz.1M160.build.flash_size_bytes=0x100000
wifi_slot.menu.eesz.1M160.build.flash_ld=eagle.flash.1m160.ld
wifi_slot.menu.eesz.1M160.build.spiffs_pagesize=256
wifi_slot.menu.eesz.1M160.upload.maximum_size=860144
wifi_slot.menu.eesz.1M160.build.rfcal_addr=0xFC000
wifi_slot.menu.eesz.1M160.build.spiffs_start=0xD3000
wifi_slot.menu.eesz.1M160.build.spiffs_end=0xFB000
wifi_slot.menu.eesz.1M160.build.spiffs_blocksize=4096
wifi_slot.menu.eesz.1M192=1M (192K SPIFFS)
wifi_slot.menu.eesz.1M192.build.flash_size=1M
wifi_slot.menu.eesz.1M192.build.flash_size_bytes=0x100000
wifi_slot.menu.eesz.1M192.build.flash_ld=eagle.flash.1m192.ld
wifi_slot.menu.eesz.1M192.build.spiffs_pagesize=256
wifi_slot.menu.eesz.1M192.upload.maximum_size=827376
wifi_slot.menu.eesz.1M192.build.rfcal_addr=0xFC000
wifi_slot.menu.eesz.1M192.build.spiffs_start=0xCB000
wifi_slot.menu.eesz.1M192.build.spiffs_end=0xFB000
wifi_slot.menu.eesz.1M192.build.spiffs_blocksize=4096
wifi_slot.menu.eesz.1M256=1M (256K SPIFFS)
wifi_slot.menu.eesz.1M256.build.flash_size=1M
wifi_slot.menu.eesz.1M256.build.flash_size_bytes=0x100000
wifi_slot.menu.eesz.1M256.build.flash_ld=eagle.flash.1m256.ld
wifi_slot.menu.eesz.1M256.build.spiffs_pagesize=256
wifi_slot.menu.eesz.1M256.upload.maximum_size=761840
wifi_slot.menu.eesz.1M256.build.rfcal_addr=0xFC000
wifi_slot.menu.eesz.1M256.build.spiffs_start=0xBB000
wifi_slot.menu.eesz.1M256.build.spiffs_end=0xFB000
wifi_slot.menu.eesz.1M256.build.spiffs_blocksize=4096
wifi_slot.menu.eesz.1M512=1M (512K SPIFFS)
wifi_slot.menu.eesz.1M512.build.flash_size=1M
wifi_slot.menu.eesz.1M512.build.flash_size_bytes=0x100000
wifi_slot.menu.eesz.1M512.build.flash_ld=eagle.flash.1m512.ld
wifi_slot.menu.eesz.1M512.build.spiffs_pagesize=256
wifi_slot.menu.eesz.1M512.upload.maximum_size=499696
wifi_slot.menu.eesz.1M512.build.rfcal_addr=0xFC000
wifi_slot.menu.eesz.1M512.build.spiffs_start=0x7B000
wifi_slot.menu.eesz.1M512.build.spiffs_end=0xFB000
wifi_slot.menu.eesz.1M512.build.spiffs_blocksize=4096
wifi_slot.menu.eesz.2M=2M (no SPIFFS)
wifi_slot.menu.eesz.2M.build.flash_size=2M
wifi_slot.menu.eesz.2M.build.flash_size_bytes=0x200000
wifi_slot.menu.eesz.2M.build.flash_ld=eagle.flash.2m.ld
wifi_slot.menu.eesz.2M.build.spiffs_pagesize=256
wifi_slot.menu.eesz.2M.upload.maximum_size=1044464
wifi_slot.menu.eesz.2M.build.rfcal_addr=0x1FC000
wifi_slot.menu.eesz.2M128=2M (128K SPIFFS)
wifi_slot.menu.eesz.2M128.build.flash_size=2M
wifi_slot.menu.eesz.2M128.build.flash_size_bytes=0x200000
wifi_slot.menu.eesz.2M128.build.flash_ld=eagle.flash.2m128.ld
wifi_slot.menu.eesz.2M128.build.spiffs_pagesize=256
wifi_slot.menu.eesz.2M128.upload.maximum_size=1044464
wifi_slot.menu.eesz.2M128.build.rfcal_addr=0x1FC000
wifi_slot.menu.eesz.2M128.build.spiffs_start=0x1E0000
wifi_slot.menu.eesz.2M128.build.spiffs_end=0x1FB000
wifi_slot.menu.eesz.2M128.build.spiffs_blocksize=4096
wifi_slot.menu.eesz.2M256=2M (256K SPIFFS)
wifi_slot.menu.eesz.2M256.build.flash_size=2M
wifi_slot.menu.eesz.2M256.build.flash_size_bytes=0x200000
wifi_slot.menu.eesz.2M256.build.flash_ld=eagle.flash.2m256.ld
wifi_slot.menu.eesz.2M256.build.spiffs_pagesize=256
wifi_slot.menu.eesz.2M256.upload.maximum_size=1044464
wifi_slot.menu.eesz.2M256.build.rfcal_addr=0x1FC000
wifi_slot.menu.eesz.2M256.build.spiffs_start=0x1C0000
wifi_slot.menu.eesz.2M256.build.spiffs_end=0x1FB000
wifi_slot.menu.eesz.2M256.build.spiffs_blocksize=4096
wifi_slot.menu.eesz.2M512=2M (512K SPIFFS)
wifi_slot.menu.eesz.2M512.build.flash_size=2M
wifi_slot.menu.eesz.2M512.build.flash_size_bytes=0x200000
wifi_slot.menu.eesz.2M512.build.flash_ld=eagle.flash.2m512.ld
wifi_slot.menu.eesz.2M512.build.spiffs_pagesize=256
wifi_slot.menu.eesz.2M512.upload.maximum_size=1044464
wifi_slot.menu.eesz.2M512.build.rfcal_addr=0x1FC000
wifi_slot.menu.eesz.2M512.build.spiffs_start=0x180000
wifi_slot.menu.eesz.2M512.build.spiffs_end=0x1FB000
wifi_slot.menu.eesz.2M512.build.spiffs_blocksize=8192
wifi_slot.menu.eesz.2M1M=2M (1M SPIFFS)
wifi_slot.menu.eesz.2M1M.build.flash_size=2M
wifi_slot.menu.eesz.2M1M.build.flash_size_bytes=0x200000
wifi_slot.menu.eesz.2M1M.build.flash_ld=eagle.flash.2m1m.ld
wifi_slot.menu.eesz.2M1M.build.spiffs_pagesize=256
wifi_slot.menu.eesz.2M1M.upload.maximum_size=1044464
wifi_slot.menu.eesz.2M1M.build.rfcal_addr=0x1FC000
wifi_slot.menu.eesz.2M1M.build.spiffs_start=0x100000
wifi_slot.menu.eesz.2M1M.build.spiffs_end=0x1FB000
wifi_slot.menu.eesz.2M1M.build.spiffs_blocksize=8192
wifi_slot.menu.ip.lm2f=v2 Lower Memory
wifi_slot.menu.ip.lm2f.build.lwip_include=lwip2/include
wifi_slot.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
wifi_slot.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
wifi_slot.menu.ip.hb2f=v2 Higher Bandwidth
wifi_slot.menu.ip.hb2f.build.lwip_include=lwip2/include
wifi_slot.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
wifi_slot.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
wifi_slot.menu.ip.lm2n=v2 Lower Memory (no features)
wifi_slot.menu.ip.lm2n.build.lwip_include=lwip2/include
wifi_slot.menu.ip.lm2n.build.lwip_lib=-llwip2-536
wifi_slot.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
wifi_slot.menu.ip.hb2n=v2 Higher Bandwidth (no features)
wifi_slot.menu.ip.hb2n.build.lwip_include=lwip2/include
wifi_slot.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
wifi_slot.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
wifi_slot.menu.ip.lm6f=v2 IPv6 Lower Memory
wifi_slot.menu.ip.lm6f.build.lwip_include=lwip2/include
wifi_slot.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
wifi_slot.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
wifi_slot.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
wifi_slot.menu.ip.hb6f.build.lwip_include=lwip2/include
wifi_slot.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
wifi_slot.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
wifi_slot.menu.ip.hb1=v1.4 Higher Bandwidth
wifi_slot.menu.ip.hb1.build.lwip_lib=-llwip_gcc
wifi_slot.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
wifi_slot.menu.ip.src=v1.4 Compile from source
wifi_slot.menu.ip.src.build.lwip_lib=-llwip_src
wifi_slot.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
wifi_slot.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
wifi_slot.menu.dbg.Disabled=Disabled
wifi_slot.menu.dbg.Disabled.build.debug_port=
wifi_slot.menu.dbg.Serial=Serial
wifi_slot.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
wifi_slot.menu.dbg.Serial1=Serial1
wifi_slot.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
wifi_slot.menu.lvl.None____=None
wifi_slot.menu.lvl.None____.build.debug_level=
wifi_slot.menu.lvl.SSL=SSL
wifi_slot.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
wifi_slot.menu.lvl.TLS_MEM=TLS_MEM
wifi_slot.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
wifi_slot.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
wifi_slot.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
wifi_slot.menu.lvl.HTTP_SERVER=HTTP_SERVER
wifi_slot.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
wifi_slot.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
wifi_slot.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
wifi_slot.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
wifi_slot.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
wifi_slot.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
wifi_slot.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
wifi_slot.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
wifi_slot.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
wifi_slot.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
wifi_slot.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
wifi_slot.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
wifi_slot.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wifi_slot.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
wifi_slot.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
wifi_slot.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
wifi_slot.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
wifi_slot.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
wifi_slot.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wifi_slot.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
wifi_slot.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wifi_slot.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
wifi_slot.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wifi_slot.menu.lvl.CORE=CORE
wifi_slot.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
wifi_slot.menu.lvl.WIFI=WIFI
wifi_slot.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
wifi_slot.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
wifi_slot.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
wifi_slot.menu.lvl.UPDATER=UPDATER
wifi_slot.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
wifi_slot.menu.lvl.OTA=OTA
wifi_slot.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
wifi_slot.menu.lvl.OOM=OOM
wifi_slot.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
wifi_slot.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
wifi_slot.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
wifi_slot.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
wifi_slot.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
wifi_slot.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
wifi_slot.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
wifi_slot.menu.wipe.none=Only Sketch
wifi_slot.menu.wipe.none.upload.erase_cmd=
wifi_slot.menu.wipe.sdk=Sketch + WiFi Settings
wifi_slot.menu.wipe.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
wifi_slot.menu.wipe.all=All Flash Contents
wifi_slot.menu.wipe.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
wifi_slot.menu.baud.115200=115200
wifi_slot.menu.baud.115200.upload.speed=115200
wifi_slot.menu.baud.9600=9600
wifi_slot.menu.baud.9600.upload.speed=9600
wifi_slot.menu.baud.57600=57600
wifi_slot.menu.baud.57600.upload.speed=57600
wifi_slot.menu.baud.230400.linux=230400
wifi_slot.menu.baud.230400.macosx=230400
wifi_slot.menu.baud.230400.upload.speed=230400
wifi_slot.menu.baud.256000.windows=256000
wifi_slot.menu.baud.256000.upload.speed=256000
wifi_slot.menu.baud.460800.linux=460800
wifi_slot.menu.baud.460800.macosx=460800
wifi_slot.menu.baud.460800.upload.speed=460800
wifi_slot.menu.baud.512000.windows=512000
wifi_slot.menu.baud.512000.upload.speed=512000
wifi_slot.menu.baud.921600=921600
wifi_slot.menu.baud.921600.upload.speed=921600

